#include<iostream> // Библеотека 

using namespace std; // Чтобы использовать std


int main(){
    int n = 5; 
    // float n; // Для чисел с запятой 
    // double n; // 
    // cin >> n;

    cout << n;
    //  % - остаток от деления 
    // 9 % 3 => 0 
    // 10 % 3 => 1 // 10 / 3 => cel :3 ,  ost : 1
    // 11 % 3 => 2 // 11 / 3 => cel :3 ,  ost : 2
    // 12 % 3 => 0 // 12 / 3 => cel :4 ,  ost : 0

    // 15 % 4 => 3 ;=> 4 * 3 + 3 = 15 
    // 18 % 4 => 2 ;=> 4 * 4 + 2 = 16
    // 21 % 8 => 5 ;=> 8 * 2 + 5 = 21
    // 21 / 8 = 2 => 21 - 8 * 2 = 5 



}



